10/data/attachments/52d746c7a57f17a5.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_actions_e466355c-ac6c-4c71-a4ff-8aeb04df75bd</nif:username>
            <nif:friendToBeAdded>Gabriel_beat_Actions_92537_3</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>